import pandas as pd
import re

df = pd.read_json("jawiki-country.json.gz", lines=True)
#'title'列が'イギリス'である行を抽出
# その行の'text'列を取得<
uk_text = df.query('title=="イギリス"')["text"].values[0]

# 正規表現を使うときは基本raw文字列にする
# そうすることで、\がただの文字としてみなされる
# raw文字列にしないと\\と2つ打つ必要がある
#'\'を打つのは、[や]をエスケープしてただの文字と見るため
#'.*'は任意の文字の0回以上の繰り返しを意味する
# \sは任意の空白文字を意味する
# .は任意の1文字
# +は一回以上の繰り返し
# ?は非貪欲マッチ
pattern = r"^(={2,})\s*(.+?)\s*(={2,}).*$"

result = "\n".join(
    i[1] + ":" + str(len(i[0]) - 1) for i in re.findall(pattern, uk_text, re.MULTILINE)
)
print(result)

# 出力
# 国名:1
# 歴史:1
# 地理:1
# 主要都市:2
# 気候:2
# 政治:1
# 元首:2
# 法:2
# 内政:2
# 地方行政区分:2
# 外交・軍事:2
# 経済:1
# 鉱業:2
# 農業:2
# 貿易:2
# 不動産:2
# エネルギー政策:2
# 通貨:2
# 企業:2
# 通信:3
# 交通:1
# 道路:2
# 鉄道:2
# 海運:2
# 航空:2
# 科学技術:1
# 国民:1
# 言語:2
# 宗教:2
# 婚姻:2
# 移住:2
# 教育:2
# 医療:2
# 文化:1
# 食文化:2
# 文学:2
# 哲学:2
# 音楽:2
# ポピュラー音楽:3
# 映画:2
# コメディ:2
# 国花:2
# 世界遺産:2
# 祝祭日:2
# スポーツ:2
# サッカー:3
# クリケット:3
# 競馬:3
# モータースポーツ:3
# 野球:3
# カーリング:3
# 自転車競技:3
# 脚注:1
# 関連項目:1
# 外部リンク:1
